
import 'package:namaa/models/question.dart';

final List<Question> questions = [
  Question(text: 'هل يستطيع الطفل أن يضع الأشياء (وراء) و (جنب) و (قريب من : مثال عندما نقول له خط الكورة جنب الكرسي ، يفهم الولد وينفذ أو خط العربية وراء الكرسي، يفهم الطفل وينفذ ؟', category: 'النمو المعرفى'),
  Question(text: 'هل يستطيع الطفل أن يجيب على بعض الأسئلة لقصة سمعها حوالي 3 مرات ؟', category: 'النمو المعرفى'),
  Question(text: 'هل يستطيع الطفل أن يخبر عن لون الشيء عندما الذكر له اسمه : مثال: عندما تسأل الطفل الموز لونه إيه ؟ يقول أصفر والتفاح لونه إيه؟ يقول أحمر ....الخ', category: 'النمو المعرفى'),
  Question(text: 'هل يستطيع الطفل أن يتعرف على مسمى خمسة أشياء من ملمسها مثال عندما تضع بعض الأشياء في صورة مجسمات مثل قلم وموبايل وكوره ....الخ فى كيس غير شفاف بدون ان يراه بعينه وينطق اسم الشى ويتعرف ع ملمسه ؟', category: 'النمو المعرفى'),
  Question(text: 'هل يستطيع الطفل أن ينسخ بالقلم على ورقة شكل مثلث عندما يطلب منه ذلك ؟', category: 'النمو المعرفى'),
  Question(text: 'هل يستطيع الطفل أن ينطط كرة كبيرة بـ يديه على الأرض ويلتقطها مره أخرى ؟', category: 'النمو الحركى'),
  Question(text: 'هل يستطيع الطفل أن يشكل قطعتين أو ثلاث من الطين صلصال ويركبها معا ليكون شكل قطة أو شكل أرنب مثلا بمساعدة بسيطة من الأم ؟', category: 'النمو الحركى'),
  Question(text: 'هل يستطيع الطفل ان يقفز فوق خيط او حبل يرتفع 5 سم عن الارض ؟', category: 'النمو الحركى'),
  Question(text: 'هل يستطيع الطفل ان يقف ع قدم واحده من 4:8 ثواثى بدون مساعدة؟', category: 'النمو الحركى'),
  Question(text: 'هل يستطيع الطفل ان يجري ويستطيع ايضا أن يغير الجاهه أثناء الجري من بين الجري يمين والجري شمال ...... الخ ؟', category: 'النمو الحركى'),

];
